[
  { "id": "p1", "tags": ["paracetamol", "fever", "pain", "headache"], "text": "Paracetamol is used for mild to moderate pain and fever relief. Maximum adult dose is 3-4g per day. Overdosing can cause severe liver damage. Always consult a professional." },
  { "id": "p2", "tags": ["ibuprofen", "nsaid", "pain", "anti-inflammatory"], "text": "Ibuprofen is a non-steroidal anti-inflammatory drug (NSAID) for pain, swelling, and fever. Take with food to avoid stomach upset. Avoid if you have gastric ulcers. Consult a professional before use." },
  { "id": "p3", "tags": ["amoxicillin", "antibiotic", "infection"], "text": "Amoxicillin is a penicillin-type antibiotic for bacterial infections. Complete the full course as prescribed to prevent antibiotic resistance. Consult a doctor." },
  { "id": "p4", "tags": ["aspirin", "headache", "blood thinner"], "text": "Aspirin is used for pain and as a blood thinner. It can increase bleeding risk. Consult a doctor before use, especially if you have a history of bleeding disorders." },
  { "id": "p5", "tags": ["expiry", "expiration", "safety"], "text": "Expired medicines can lose potency and may become unsafe. Always check the expiration date and dispose of medication safely. Consult a professional." },
  { "id": "p6", "tags": ["dosage", "dose"], "text": "Always follow dosage instructions from the label or your doctor. Taking too much is dangerous; too little may be ineffective. Consult a doctor before changing your dose." },
  { "id": "p7", "tags": ["side effects", "warnings"], "text": "All medications can have side effects. If you experience severe or unexpected side effects, stop taking the medication and seek medical advice immediately." },
  { "id": "p8", "tags": ["antihistamine", "allergy", "hay fever"], "text": "Antihistamines relieve allergy symptoms. Some cause drowsiness, so check the label before driving. Consult a pharmacist." },
  { "id": "p9", "tags": ["cold", "flu", "symptoms"], "text": "For common cold symptoms, use over-the-counter medications. Follow instructions carefully and do not mix different cold medications. Consult a professional." },
  { "id": "p10", "tags": ["prescription", "over the counter"], "text": "Prescription medications require a doctor's order. Over-the-counter (OTC) drugs can be bought freely. Always check with a pharmacist if you're unsure which is right for you." },
  { "id": "p11", "tags": ["storage", "medication", "store"], "text": "Store medications in a cool, dry place away from sunlight and moisture. The bathroom is often too humid. Keep all medication out of the reach of children and pets. Consult a professional for specific storage instructions." },
  { "id": "p12", "tags": ["refill"], "text": "Refill your prescriptions before you run out. Many pharmacies offer automatic refills. Do not stop taking your medication without consulting a doctor." },
  { "id": "p13", "tags": ["diabetes", "insulin", "blood sugar"], "text": "Diabetes medications, like insulin, control blood sugar. Monitor your blood sugar as directed by your doctor. Consult a doctor for any changes in your treatment plan." },
  { "id": "p14", "tags": ["blood pressure", "hypertension"], "text": "Medications for high blood pressure reduce the risk of heart attack and stroke. Take them regularly. Do not stop taking them without consulting a doctor." },
  { "id": "p15", "tags": ["cetirizine", "allergy"], "text": "Cetirizine is an antihistamine for allergies. It's generally non-drowsy. Take once daily. Consult a pharmacist." },
  { "id": "p16", "tags": ["loratadine", "allergy"], "text": "Loratadine is an antihistamine for allergies. It is non-drowsy for most people. Follow dosage instructions. Consult a pharmacist." },
  { "id": "p17", "tags": ["vitamin c", "supplement"], "text": "Vitamin C supports a healthy immune system. Found in citrus fruits. Do not take high doses without consulting a doctor." },
  { "id": "p18", "tags": ["melatonin", "sleep"], "text": "Melatonin is a supplement for occasional sleeplessness. Consult a professional before using, especially if you have a medical condition." },
  { "id": "p19", "tags": ["heartburn", "antacid"], "text": "Antacids provide quick relief for occasional heartburn. If symptoms are frequent or severe, consult a doctor." },
  { "id": "p20", "tags": ["omeprazole", "heartburn"], "text": "Omeprazole is a proton pump inhibitor (PPI) for frequent heartburn. It reduces stomach acid. Take as directed by a doctor." },
  { "id": "p21", "tags": ["dizziness", "side effects"], "text": "Dizziness can be a side effect. If you feel dizzy, avoid driving and stand up slowly. Report persistent dizziness to your doctor." },
  { "id": "p22", "tags": ["pregnancy", "safety"], "text": "Always consult a doctor or pharmacist before taking any medication while pregnant or breastfeeding. The safety of the baby is paramount." },
  { "id": "p23", "tags": ["vaccine", "immunization"], "text": "Vaccines help the body build immunity to disease. They are safe and effective. Consult a doctor for your immunization schedule." },
  { "id": "p24", "tags": ["warfarin", "blood thinner"], "text": "Warfarin is a powerful blood thinner that requires regular monitoring. Do not change your dose without a doctor's supervision." },
  { "id": "p25", "tags": ["statin", "cholesterol"], "text": "Statins lower cholesterol and reduce heart disease risk. Take them long-term as directed. Consult a doctor for monitoring." },
  { "id": "p26", "tags": ["antifungal", "infection"], "text": "Antifungal medications treat fungal infections. Complete the full course to prevent recurrence. Do not stop treatment early. Consult a professional." },
  { "id": "p27", "tags": ["nausea", "upset stomach"], "text": "Nausea can be a side effect. Small, frequent meals and clear liquids may help. If it persists, consult a doctor." },
  { "id": "p28", "tags": ["constipation", "laxative"], "text": "For constipation, laxatives can provide relief. Drink plenty of water and increase fiber intake. Do not use laxatives long-term without medical advice." },
  { "id": "p29", "tags": ["diarrhea"], "text": "Diarrhea can be treated with anti-diarrheal medication. Drink plenty of fluids to prevent dehydration. If it persists for more than 48 hours, consult a doctor." },
  { "id": "p30", "tags": ["cough", "suppressant"], "text": "Cough suppressants relieve dry, hacking coughs. Expectorants help clear mucus from the lungs for wet coughs. Match the medication to your type of cough. Consult a pharmacist." },
  { "id": "p31", "tags": ["fexofenadine", "allergy"], "text": "Fexofenadine is a non-drowsy antihistamine for seasonal allergies. Follow the dosage instructions and avoid taking with fruit juice. Consult a pharmacist." },
  { "id": "p32", "tags": ["antibiotic", "probiotics"], "text": "Probiotics can help restore good bacteria in your gut that antibiotics may kill. Consider taking them a few hours after your antibiotic dose. Consult a professional." },
  { "id": "p33", "tags": ["pain", "back pain"], "text": "For back pain, NSAIDs like Ibuprofen or heat/cold packs can help. If the pain is severe or chronic, consult a doctor for a proper diagnosis." },
  { "id": "p34", "tags": ["fever", "children", "pediatric"], "text": "For children's fever, use pediatric-specific formulations of Paracetamol or Ibuprofen. Always follow age and weight-based dosing. Never give Aspirin to children. Consult a pediatrician." },
  { "id": "p35", "tags": ["antidepressant", "mental health"], "text": "Antidepressants are prescription medications for depression and anxiety. They can take several weeks to become effective. Do not stop taking them abruptly without a doctor's guidance." },
  { "id": "p36", "tags": ["lithium", "bipolar"], "text": "Lithium is a mood stabilizer for bipolar disorder. It requires careful monitoring of blood levels. Be mindful of dehydration. Consult your doctor for regular check-ups." },
  { "id": "p37", "tags": ["vitamin d", "supplement"], "text": "Vitamin D is essential for bone health and immune function. It can be obtained from sunlight and certain foods. Supplements are common, but high doses can be toxic. Consult a professional." },
  { "id": "p38", "tags": ["calcium", "bone health"], "text": "Calcium is a mineral essential for strong bones and teeth. Supplements may be needed, but too much can cause problems. Consult a doctor or dietitian." },
  { "id": "p39", "tags": ["epilepsy", "seizure"], "text": "Antiepileptic drugs control seizures. It is vital to take them consistently at the same time each day. Do not miss doses. Consult a doctor." },
  { "id": "p40", "tags": ["cough", "codeine"], "text": "Codeine is a narcotic cough suppressant. It can cause drowsiness and constipation. It is not suitable for everyone. Consult a doctor or pharmacist before using." },
  { "id": "p41", "tags": ["acne", "antibiotic"], "text": "For severe acne, topical or oral antibiotics may be prescribed. They reduce inflammation and bacteria. Use as directed to avoid resistance. Consult a dermatologist." },
  { "id": "p42", "tags": ["sunscreen", "uv protection"], "text": "Sunscreen protects your skin from harmful UV rays. Use an SPF of at least 30, and reapply every two hours, or after swimming. Consult a professional." },
  { "id": "p43", "tags": ["allergy", "anaphylaxis", "epinephrine"], "text": "For severe allergic reactions (anaphylaxis), an epinephrine auto-injector is an emergency treatment. Learn how to use it and carry it at all times if prescribed. Call emergency services immediately." },
  { "id": "p44", "tags": ["diabetes", "metformin"], "text": "Metformin is a common oral medication for Type 2 diabetes. It helps control blood sugar. Take it with meals to reduce stomach side effects. Consult a doctor." },
  { "id": "p45", "tags": ["high blood pressure", "ace inhibitor"], "text": "ACE inhibitors are a class of drugs for high blood pressure. They may cause a dry cough. Report persistent side effects to your doctor. Do not stop taking without medical advice." },
  { "id": "p46", "tags": ["diuretic", "water pill"], "text": "Diuretics, or 'water pills', help reduce fluid in the body. They are used for high blood pressure and fluid retention. Consult your doctor, as they may affect your potassium levels." },
  { "id": "p47", "tags": ["birth control", "contraceptive"], "text": "Birth control pills are used to prevent pregnancy. For best results, they must be taken consistently at the same time each day. Consult a doctor for the best method for you." },
  { "id": "p48", "tags": ["gout", "allopurinol"], "text": "Allopurinol is a medication for preventing gout attacks. It works by reducing uric acid levels. It is not for treating an acute attack. Consult a doctor for proper use." },
  { "id": "p49", "tags": ["fluconazole", "antifungal"], "text": "Fluconazole is an antifungal medication for yeast infections. It is typically a single-dose treatment. Consult a doctor or pharmacist for proper diagnosis and dosage." },
  { "id": "p50", "tags": ["migraine", "triptan"], "text": "Triptans are a class of prescription drugs for treating migraine headaches. They are most effective when taken at the first sign of a migraine. They are not for prevention. Consult a doctor." },
  { "id": "p51", "tags": ["asthma", "inhaler"], "text": "Asthma is treated with inhalers, which can be rescue inhalers for acute attacks or long-term controllers for prevention. Use as directed by your doctor. Do not overuse rescue inhalers." },
  { "id": "p52", "tags": ["prednisone", "steroid"], "text": "Prednisone is a steroid for inflammation. It is important to follow the dose and tapering schedule precisely. Do not stop taking it suddenly. Consult a doctor." },
  { "id": "p53", "tags": ["psoriasis", "topical cream"], "text": "Psoriasis can be treated with topical creams and ointments. Use a thin layer on affected skin as directed. Consult a dermatologist for the best treatment plan." },
  { "id": "p54", "tags": ["anxiety", "benzodiazepine"], "text": "Benzodiazepines are for short-term treatment of severe anxiety. They can be habit-forming. Do not use for long periods. Consult a doctor for a proper treatment plan." },
  { "id": "p55", "tags": ["iron", "anemia"], "text": "Iron supplements treat iron-deficiency anemia. Take with vitamin C to increase absorption. Can cause constipation. Consult a doctor before starting." },
  { "id": "p56", "tags": ["zinc", "supplement", "immune system"], "text": "Zinc is a mineral that helps the immune system. Found in meat and whole grains. High doses can interfere with other minerals. Consult a professional." },
  { "id": "p57", "tags": ["potassium", "supplement"], "text": "Potassium is an electrolyte important for nerve and muscle function. Supplements may be needed with diuretic use. Consult a doctor before starting." },
  { "id": "p58", "tags": ["magnesium", "supplement"], "text": "Magnesium is a mineral for muscle function and sleep. Supplements can help, but too much can cause diarrhea. Consult a professional." },
  { "id": "p59", "tags": ["allergy", "epipen"], "text": "An EpiPen (epinephrine auto-injector) is for life-threatening allergic reactions. Use immediately and then call emergency services. Learn how to use it correctly." },
  { "id": "p60", "tags": ["pain", "tramadol"], "text": "Tramadol is a prescription opioid pain reliever. It can be habit-forming. Do not take with alcohol or other depressants. Use as directed by a doctor." },
  { "id": "p61", "tags": ["acne", "retinoid"], "text": "Topical retinoids treat acne by unclogging pores. They can make skin sensitive to sun. Use sunscreen daily. Consult a dermatologist." },
  { "id": "p62", "tags": ["gastrointestinal", "gi", "probiotics"], "text": "Probiotics contain beneficial bacteria for gut health. They can help with digestion and some GI issues. Consult a professional." },
  { "id": "p63", "tags": ["pain", "gabapentin"], "text": "Gabapentin is an antiepileptic drug also used for nerve pain. Do not stop taking it abruptly. Consult a doctor." },
  { "id": "p64", "tags": ["hypertension", "beta blocker"], "text": "Beta blockers are for high blood pressure and heart conditions. They can slow heart rate. Do not stop taking them suddenly. Consult a doctor." },
  { "id": "p65", "tags": ["antihistamine", "diphenhydramine"], "text": "Diphenhydramine (Benadryl) is a strong antihistamine that causes significant drowsiness. It can be used for allergies or as a sleep aid. Avoid driving or operating machinery." },
  { "id": "p66", "tags": ["migraine", "prevention"], "text": "Migraine prevention can involve lifestyle changes and medications. If you have frequent migraines, consult a doctor to discuss prevention strategies." },
  { "id": "p67", "tags": ["antifungal", "topical"], "text": "Topical antifungal creams treat skin and nail infections. Use as directed and continue for the full treatment duration, even if symptoms improve. Consult a professional." },
  { "id": "p68", "tags": ["steroid", "inhaler"], "text": "Inhaled corticosteroids are for long-term asthma control. They reduce inflammation in the airways. Use daily as prescribed. Consult a doctor." },
  { "id": "p69", "tags": ["depression", "ssri"], "text": "SSRIs (Selective Serotonin Reuptake Inhibitors) are a class of antidepressants. It may take weeks for them to work. Do not stop without consulting a doctor." },
  { "id": "p70", "tags": ["anxiety", "ssri"], "text": "SSRIs are also prescribed for anxiety disorders. They are not sedatives and work over time. Consult a doctor for a proper diagnosis." },
  { "id": "p71", "tags": ["thyroid", "levothyroxine"], "text": "Levothyroxine is a synthetic thyroid hormone for an underactive thyroid. Take on an empty stomach with water, and avoid food for 30-60 minutes. Consult a doctor for regular monitoring." },
  { "id": "p72", "tags": ["birth control", "missed dose"], "text": "If you miss a dose of birth control, follow the instructions on the packet. If you are unsure, use a backup method and consult your doctor or pharmacist." },
  { "id": "p73", "tags": ["pain", "acetaminophen"], "text": "Acetaminophen is the active ingredient in Tylenol and is the same as Paracetamol. It is used for pain and fever. Be careful not to exceed the maximum daily dose. Consult a professional." },
  { "id": "p74", "tags": ["cough", "dextromethorphan"], "text": "Dextromethorphan is a common cough suppressant found in many OTC cold medicines. It is for dry coughs. Consult a pharmacist to ensure it's right for you." },
  { "id": "p75", "tags": ["antacid", "tums"], "text": "Tums are a brand of antacid containing calcium carbonate for fast relief of heartburn. They are for occasional use. Consult a doctor if you need them frequently." },
  { "id": "p76", "tags": ["diabetic", "glipizide"], "text": "Glipizide is an oral medication for Type 2 diabetes. It helps the body produce insulin. Be mindful of low blood sugar. Consult a doctor." },
  { "id": "p77", "tags": ["stomach", "bloating", "gas"], "text": "For gas and bloating, simethicone-containing products can help. Lifestyle changes, like eating slowly, can also be effective. Consult a professional." },
  { "id": "p78", "tags": ["dehydration", "electrolytes"], "text": "Dehydration can be a risk with fever, diarrhea, or vomiting. Oral rehydration solutions (ORS) with electrolytes can help. Consult a doctor." },
  { "id": "p79", "tags": ["gout", "colchicine"], "text": "Colchicine is a medication used to treat acute gout attacks. It is not a long-term preventative medication. Consult a doctor for the correct usage." },
  { "id": "p80", "tags": ["acne", "benzoyl peroxide"], "text": "Benzoyl peroxide is a topical treatment for acne that kills bacteria and helps unclog pores. It can cause skin dryness and irritation. Use as directed by a professional." },
  { "id": "p81", "tags": ["flu", "oseltamivir"], "text": "Oseltamivir (Tamiflu) is an antiviral for the flu. It is most effective when taken within 48 hours of symptoms. It is a prescription medication. Consult a doctor." },
  { "id": "p82", "tags": ["pain", "naproxen"], "text": "Naproxen is an NSAID for pain and inflammation. It lasts longer than Ibuprofen. Take with food to reduce stomach upset. Consult a professional." },
  { "id": "p83", "tags": ["cough", "guaifenesin"], "text": "Guaifenesin is an expectorant that helps thin and loosen mucus in the chest. Drink plenty of water to help it work effectively. Consult a pharmacist." },
  { "id": "p84", "tags": ["muscle relaxant", "cyclobenzaprine"], "text": "Cyclobenzaprine is a muscle relaxant for muscle spasms. It can cause drowsiness. Avoid driving. Consult a doctor before use." },
  { "id": "p85", "tags": ["steroid", "fluticasone"], "text": "Fluticasone is a nasal spray steroid for allergies and hay fever. It reduces inflammation in the nose. Use consistently for best results. Consult a professional." },
  { "id": "p86", "tags": ["blood thinner", "rivaroxaban"], "text": "Rivaroxaban (Xarelto) is a newer type of blood thinner. It is a prescription medication to prevent blood clots. Consult a doctor for a proper monitoring plan." },
  { "id": "p87", "tags": ["cholesterol", "ezetimibe"], "text": "Ezetimibe is a medication that lowers cholesterol by blocking its absorption. It is often used with statins. Consult a doctor for monitoring." },
  { "id": "p88", "tags": ["antihypertensive", "lisinopril"], "text": "Lisinopril is an ACE inhibitor for high blood pressure. It may cause a persistent, dry cough. Do not stop taking without a doctor's advice." },
  { "id": "p89", "tags": ["thyroid", "levothyroxine"], "text": "Levothyroxine is a synthetic thyroid hormone for an underactive thyroid. Take on an empty stomach with water, and avoid food for 30-60 minutes. Consult a doctor for regular monitoring." },
  { "id": "p90", "tags": ["pain", "opioid", "oxycodone"], "text": "Oxycodone is a strong prescription opioid pain reliever. It is highly addictive. Use only as directed by a doctor and never share with others." },
  { "id": "p91", "tags": ["antibiotic", "doxycycline"], "text": "Doxycycline is a broad-spectrum antibiotic. It can make your skin more sensitive to sunlight. Wear sunscreen. Consult a professional." },
  { "id": "p92", "tags": ["vitamin b12", "supplement"], "text": "Vitamin B12 is crucial for nerve function and red blood cell formation. Supplements are available. Consult a doctor to check for a deficiency." },
  { "id": "p93", "tags": ["allergy", "epinephrine"], "text": "Epinephrine is the emergency treatment for a severe allergic reaction (anaphylaxis). Learn how to use your auto-injector and carry it with you if prescribed." },
  { "id": "p94", "tags": ["pain", "neuropathic"], "text": "Neuropathic pain, or nerve pain, may require specific medications. Over-the-counter pain relievers are often not effective. Consult a doctor." },
  { "id": "p95", "tags": ["diuretic", "furosemide"], "text": "Furosemide is a diuretic ('water pill'). It helps the body get rid of excess fluid. This can affect potassium levels. Consult a doctor for monitoring." },
  { "id": "p96", "tags": ["migraine", "sumatriptan"], "text": "Sumatriptan is a triptan for migraines. It is not for prevention. Take it at the start of a migraine. Consult a doctor." },
  { "id": "p97", "tags": ["asthma", "albuterol"], "text": "Albuterol is a rescue inhaler for asthma attacks. It provides quick relief. Use it only as needed. Consult a doctor." },
  { "id": "p98", "tags": ["antidepressant", "citalopram"], "text": "Citalopram is an antidepressant (SSRI). It can take several weeks to work. Do not stop taking it without a doctor's guidance." },
  { "id": "p99", "tags": ["pain", "ketorolac"], "text": "Ketorolac is a powerful NSAID for short-term, moderate to severe pain. It is often prescribed after surgery. Consult a doctor." },
  { "id": "p100", "tags": ["cholesterol", "rosuvastatin"], "text": "Rosuvastatin is a potent statin for lowering cholesterol. It is typically taken once daily. Consult a doctor for regular monitoring." }
]